biletbank-updatepassengers/BILETBANK API REQUEST&RESPONSE - V2 BrandedFareItemId - RT RecommendationBox/Finalizeshopping req

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:trev="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Base" xmlns:trev1="http://schemas.datacontract.org/2004/07/Trevoo.WS.IO.Shopping" xmlns:trev2="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Shopping">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:FinalizeShopping>
         <!--Optional:-->
         <tem:request>
            <!--Optional:-->
            <trev:AuthenticationHeader>
               <!--Optional:-->
               <trev:SessionId>7434204</trev:SessionId>
               <trev:SessionToken>db14f99c-897e-4c51-8599-115813e40836</trev:SessionToken>
            </trev:AuthenticationHeader>
            <trev1:Form>
               <!--Optional:-->
               <trev1:BillingInfo>
                  <!--Optional:-->
                  <trev2:Address_City>ISTANBUL</trev2:Address_City>
                  <!--Optional:-->
                  <trev2:Address_Detail>COBANCESME SAN. CD. NO.44 NISH ISTANBUL C BLOK K:17 D:200</trev2:Address_Detail>
                  <!--Optional:-->
                  <trev2:Address_District>BAHCELIEVLER</trev2:Address_District>
                  <!--Optional:-->
                  <trev2:Address_ZipCode>0000</trev2:Address_ZipCode>
                  <!--Optional:-->
                  <trev2:BillingName>TEST</trev2:BillingName>
                  <!--Optional:-->
                  <trev2:CountryCode>TR</trev2:CountryCode>
                  <!--Optional:-->
                  <trev2:IfCompany>1</trev2:IfCompany>
                  <!--Optional:-->
                  <trev2:TaxNo>1111111111</trev2:TaxNo>
                  <!--Optional:-->
                  <trev2:TaxOffice>test</trev2:TaxOffice>
               </trev1:BillingInfo>
               <!--Optional:-->
               <trev1:ShoppingFileId>87264cf8-dcf1-4a4d-b303-05ab97ff26b7</trev1:ShoppingFileId>
            </trev1:Form>
         </tem:request>
      </tem:FinalizeShopping>
   </soapenv:Body>
</soapenv:Envelope>